src/Documents/ИС_ЯМ_ФормированиеПоставкиFBO.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИС_ЯМ_ФормированиеПоставкиFBO</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогоНоменклатуры</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаркированныйТовар</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Catalogs/ИС_ЯМ_Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИС_ЯМ_Штрихкоды</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ИС_ЯМ_Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ИС_ЯМ_Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИС_ЯМ_Номенклатура</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>shopSku</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>manufacturer</Name>
					<Comment>Изготовитель товара</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>vendor</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>vendorCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>marketSku</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>modelId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>categoryId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MD5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>archived</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>length</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>width</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>height</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>weight</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>volume</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КГТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Documents/ИС_ЯМ_ФормированиеПоставкиFBO/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
//+ ИнфоСофт Стояк Ю.К. 25.01.2024 УА #69482
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СортировкаЭтикеток = "Наименование";
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.01.2024 УА #69482

#КонецОбласти
#Область ОбработчикиКомандФорм              

//+ ИнфоСофт Стояк Ю.К. 25.01.2024 УА #69482
&НаКлиенте
Процедура ПечатьШтрихкодов(Команда)  
	
	Массив = Элементы.Список.ВыделенныеСтроки;
	
	Табличныйдокумент = СформироватьТабличныйДокументЭтикетки(Массив); 
	
	Табличныйдокумент.Показать();
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.01.2024 УА #69482

#КонецОбласти

#Область СлужебныеПроцедурыИФункции   

//+ ИнфоСофт Стояк Ю.К. 22.10.2023 УА #69482
&НаСервере
Функция СформироватьТабличныйДокументЭтикетки(МассивОбъектов)  
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати = "Этикетка";		
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИС_ЯМ_ФормированиеПоставкиFBO.ПФ_MXL_Штрихкод58х40_ЯМ");
	
	ОбластьМакетаОсновныеДанные = Макет.ПолучитьОбласть("Этикетка");      
	
	Эталон = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ИС_МП_Эталон"); 
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	
	Для Каждого ЭлементМассива Из МассивОбъектов Цикл
		
		ДанныеДок = ПолучитьДанныеДляФормированияЭтикетки(ЭлементМассива.Ссылка); 
		ДанныеДок.Сортировать(СортировкаЭтикеток + " Возв");
		
		Для Каждого Данные Из ДанныеДок Цикл 
			
			Для Итератор = 1 По Данные.Количество Цикл    
				
				ОбластьМакетаОсновныеДанные.Параметры.Заполнить(Данные);
				
				ПараметрыШК = ИС_MP_ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
				
				ПараметрыШК.Ширина = Окр(ОбластьМакетаОсновныеДанные.Рисунки.Штрихкод.Ширина / КоличествоМиллиметровВПикселе);
				ПараметрыШК.Высота = Окр(ОбластьМакетаОсновныеДанные.Рисунки.Штрихкод.Высота / КоличествоМиллиметровВПикселе);
				ПараметрыШК.РазмерШрифта = 10;
				ПараметрыШК.Штрихкод = Данные.Штрихкод;
				ПараметрыШК.Масштабировать = Истина;
				ПараметрыШК.СохранятьПропорции = Истина;
				ПараметрыШК.ВертикальноеВыравнивание = 2;
				
				СтруктураКартинки = ИС_MP_ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШК);
				
				Если СтруктураКартинки.Результат Тогда	
					ОбластьМакетаОсновныеДанные.Рисунки.Штрихкод.Картинка = СтруктураКартинки.Картинка;
				КонецЕсли;  
				
				ТабличныйДокумент.Вывести(ОбластьМакетаОсновныеДанные);
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц(); 
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 22.10.2023 УА #69482

//+ ИнфоСофт Стояк Ю.К. 22.10.2023 УА #69482
&НаСервере
Функция ПолучитьДанныеДляФормированияЭтикетки(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Штрихкоды.Штрихкод КАК Штрихкод,
	|	Штрихкоды.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_Штрихкоды
	|ИЗ
	|	&Штрихкоды КАК Штрихкоды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_Штрихкоды.Количество) КАК Количество,
	|	ИС_ЯМ_Штрихкоды.Наименование КАК Штрихкод,
	|	ИС_ЯМ_Номенклатура.shopSku КАК Артикул,
	|	ИС_ЯМ_Номенклатура.Наименование КАК Наименование
	|ИЗ
	|	ВТ_Штрихкоды КАК ВТ_Штрихкоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_ЯМ_Штрихкоды КАК ИС_ЯМ_Штрихкоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_ЯМ_Номенклатура КАК ИС_ЯМ_Номенклатура
	|			ПО ИС_ЯМ_Штрихкоды.Владелец = ИС_ЯМ_Номенклатура.Ссылка
	|		ПО ВТ_Штрихкоды.Штрихкод = ИС_ЯМ_Штрихкоды.Наименование
	|ГДЕ
	|	ИС_ЯМ_Номенклатура.Профиль = &Профиль
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_ЯМ_Штрихкоды.Наименование,
	|	ИС_ЯМ_Номенклатура.shopSku,
	|	ИС_ЯМ_Номенклатура.Наименование";
	
	Запрос.УстановитьПараметр("Штрихкоды", Документ.Товары.Выгрузить());
	Запрос.УстановитьПараметр("Профиль", Документ.Профиль);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();     
	
	ТЗ = РезультатЗапроса.Выгрузить();
	
	МассивАртикулов = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		МассивАртикулов.Добавить(ВыборкаДетальныеЗаписи.Артикул);		
	КонецЦикла;  
	
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("offerIds", МассивАртикулов);
	
	Результат = ИС_ЯМ_Сервер.ПолучитьИнформациюОКарточкахПоАртикулу(Документ.Профиль, ТелоЗапроса); 
	
	Если Результат = Неопределено Тогда
		Возврат ТЗ;
	КонецЕсли;
	
	Для Каждого Товар Из Результат.offerMappings Цикл	 
		
		Если Товар.Свойство("offer") Тогда  
			
			Отбор = Новый Структура("Артикул", Товар.offer.offerId);
			
			НайденныеСтроки = ТЗ.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() > 0 Тогда 
				
				Для Каждого Строка Из НайденныеСтроки Цикл
			 		Строка.Наименование = Товар.offer.name;
				КонецЦикла;
			
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЦикла;

	
	Возврат ТЗ;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 22.10.2023 УА #69482	

#КонецОбласти  

#Область ПроверкаАктаПриемки

#КонецОбласти
